{
  "menu.logo": "Mario Lazzari",
  "menu.home": "Home",
  "menu.certifications": "Certifications",
  "menu.contacts": "Contacts",
  "menu.skills": "Skills",
  "menu.hobbies": "Hobbies",
  "menu.jobs": "Job",

  "home.title": "Mario Lazzari Full stack developrt",
  "home.subtitle": "JavaScript Full Stack Developer",
  "home.intro": "Welcome to my site, where I will share some infos about myself, my hobbies and the tools I use in my daily activity as a software developer.",
  "home.mailButton": "Mail",
  "home.cvButton": "Resume",

  "home.toolsTitle": "Main tools",
  "home.toolsSubtitle": "Click here for listing all my skills",
  "home.mongoTitle": "MongoDB",
  "home.mongoText": "MongoDB is a document database with the scalability and flexibility that you want with the querying and indexing that you need. MongoDB’s document model is simple for developers to learn and use, while still providing all the capabilities needed to meet the most complex requirements at any scale.",
  "home.expressTitle": "ExpressJS",
  "home.expressText": "Express è un framework per applicazioni web Node.js flessibile e leggero che fornisce una serie di funzioni avanzate per le applicazioni web e per dispositivi mobili. Con una miriade di metodi di utilità HTTP e middleware a disposizione, la creazione di un'API affidabile è un processo facile e veloce.",
  "home.reactTitle": "ReactJS",
  "home.reactText": "React makes it painless to create interactive UIs. Design simple views for each state in your application, and React will efficiently update and render just the right components when your data changes. Declarative views make your code more predictable and easier to debu",
  "home.nodeTitle": "NodeJS",
  "home.nodeText": "Node.js is an open-source, cross-platform, back-end, JavaScript runtime environment that executes JavaScript code outside a web browser. Node.js lets developers use JavaScript to write command line tools and for server-side scripting—running scripts server-side to produce dynamic web page content before the page is sent to the user's web browser.",

  "home.certTitle": "Last certifications",
  "home.certSubtitle": "Click here for my certifications full list",

  "home.github": "My last year on Github",

  "socials.error": "Error while getting social accounts..",

  "skills.title": "Skills Mario Lazzari",
  "skills.os": "Operating systems",
  "skills.lang": "Programming languages",
  "skills.db": "Databases",
  "skills.ide": "Integrated development enviroments",
  "skills.libs": "Libraries",
  "skills.tools": "Tools",

  "certs.title": "Certifications Mario Lazzari Full Stack Javascript Developer",
  "certs.search": "Search",

  "jobs.title": "Job Mario Lazzari Full Stack JavaScript Developer",

  "hobbies.title": "Hobbies Mario Lazzari Full Stack JavaScript Developer",
  "hobbies.more": "Learn more",
  "hobbies.nasaTitle": "Nasa Open API",
  "hobbies.nasaDesc": "In this section you will find lots on information, videos and images, made avaible by NASA official site: astronomic picture of the day, missions from both mars and moon and meny more.",
  "hobbies.rijksTitle": "Rijksmuseum",
  "hobbies.rijksDesc": "Rijksmuseum data services provide access to object metadata, bibliographic data, controlled vocabularies and user generated content.",
  "hobbies.metTitle": "Matropolitan museum",
  "hobbies.metDesc": "The Metropolitan Museum of Art presents over 5,000 years of art from around the world for everyone to experience and enjoy. The Museum lives in two iconic sites in New York City",

  "nasa.title": "Mario Lazzari NASA search engine",
  "nasa.zoom": "Zoom",
  "nasa.zoomHD": "Zoom HD",
  "nasa.records": "Records found:",
  "nasa.today": "Today's picture:",
  "nasa.placeholder": "Type here one or more terms: mars, moon, veus...",

  "contacts.title": "Contancts - Mario Lazzari Full Stack Javascript Developer",
  "contacts.mail": "You can send me an email here:",
  "contacts.social": "...or find me on the following social accounts:",

  "button.back": "Back",
  "button.more": "Learn more",
  "button.search": "Search",
  "button.options": "Options"
}
