{
  "Menu": {
    "home": "Home",
    "certifications": "Certifications",
    "skills": "Skills",
    "projects": "Projects",
    "hobbies": "Hobbies"
  },

  "Home": {
    "pageTitle": "Mario Lazzari - JavaScript Full Stack Developer",
    "title": "Mario Lazzari",
    "subtitle": "Senior Full Stack Developer",
    "intro": "Welcome to my site, where I will share some infos about myself, my hobbies and the tools I use in my daily activity as a software developer.",
    "mailButton": "Mail",
    "cvButton": "Resume",
    "skillsTitle": "My skills",
    "skillsButton": "Skills",
    "githubLastYear": "My last year on Github",
    "certTitle": "Last certifications",
    "certButton": "Certifications"
  },

  "SkillTypes": {
    "os": "Operating Systems",
    "lang": "Programming Languages",
    "ide": "IDE",
    "db": "Database",
    "lib": "Libraries",
    "tool": "Tools"
  },

  "Github": {
    "title": "Github profile",
    "followers": "Followers",
    "following": "Following",
    "projects": "Projects",
    "stars": "Stars",
    "forks": "Forks"
  },

  "Skills": {
    "title": "My skills",
    "os": "Operating systems",
    "lang": "Programming languages",
    "db": "Databases",
    "ide": "Integrated development enviroments",
    "lib": "Libraries",
    "tools": "Tools",
    "debianDesc": "Debian also known as Debian GNU/Linux, is a Linux distribution composed of free and open-source software, developed by the community-supported Debian Project, which was established by Ian Murdock on August 16, 1993. The first version of Debian (0.01) was released on September 15, 1993, and its first stable version (1.1) was released on June 17, 1996.",
    "debianUse": "I used Debian mainly for web server, FTP service and storage projectsy. I use this distribution as my main desktop machine too for years.",
    "ubuntuDesc": "Ubuntu is a Linux distribution based on Debian and mostly composed of free and open-source software. Ubuntu is officially released in three editions: Desktop, Server,[and Core for Internet of things devices and robots. All the editions can run on the computer alone, or in a virtual machine. Ubuntu is a popular operating system for cloud computing, with support for OpenStack.",
    "ubuntuUse": "I used Ubuntu as my main production server, where to deploy all my projects: this site itself in hosted on a Ububto 20:04 LTS server.",
    "oracleLinuxDesc": "Oracle Linux (abbreviated OL, formerly known as Oracle Enterprise Linux or OEL) is a Linux distribution packaged and freely distributed by Oracle, available partially under the GNU General Public License since late 2006. It is compiled from Red Hat Enterprise Linux (RHEL) source code, replacing Red Hat branding with Oracle's. It is also used by Oracle Cloud and Oracle Engineered Systems such as Oracle Exadata and others.",
    "oracleLinuxUse": "Oracle Linux is my primary choice, in order to host Oracle databese instance smoothly.",
    "redHatDesc": "Red Hat® Enterprise Linux® is the world’s leading enterprise Linux platform.* It’s an open source operating system (OS). It’s the foundation from which you can scale existing apps—and roll out emerging technologies—across bare-metal, virtual, container, and all types of cloud environments.",
    "redHatUse": "I used this os as a good alternative to Oracle Linux, in order to host Oracle database instances.",
    "winServerDesc": "Windows Server is a brand name for a group of server operating systems released by Microsoft. It includes all Windows operating systems that are branded 'Windows Server', but not any other Microsoft product. The first Windows server edition to be released under that brand was Windows Server 2003. However, the first server edition of Windows was Windows NT.",
    "winServerUse": "I use this operating system mainly as primary omain controller and for hosting Sql Server database instances.",
    "as400Desc": "The IBM System i is a midrange computer platform from IBM, sometimes referred to generically by the umbrella term AS/400 or 'AS400'. The platform was first introduced as the AS/400 (Application System/400) in June 1988, with the operating system being called OS/400. In 2000, IBM introduced the eServer iSeries (with the 400 sometimes added[1]). As part of IBM's re-branding initiative in 2006, it was again renamed to System i.",
    "as400Use": "I used this operating system for hosting DB2 database instances and managing ERP softwares.",
    "solarisDesc": "Solaris is a proprietary Unix operating system originally developed by Sun Microsystems. It superseded the company's earlier SunOS in 1993. In 2010, after the Sun acquisition by Oracle, it was renamed Oracle Solaris. Solaris is known for its scalability, especially on SPARC systems, and for originating many innovative features such as DTrace, ZFS and Time Slider.",
    "solarisUse": "I used this operating system for deploying enterprise Java applications.",
    "jsDesc": "JavaScript (JS) is a lightweight, interpreted, or just-in-time compiled programming language with first-class functions. While it is most well-known as the scripting language for Web pages, many non-browser environments also use it, such as Node.js, Apache CouchDB.0",
    "jsUse": "Javascript is my main programming language for all my client and server projrct. Thanks to NodeJS enviroment and React Native, I am able to code multiplatform native mobile app too.",
    "htmlDesc": "HTML (HyperText Markup Language) is the most basic building block of the Web. It defines the meaning and structure of web content. Other technologies besides HTML are generally used to describe a web page's appearance/presentation (CSS) or functionality/behavior (JavaScript).",
    "htmlUse": "I use HTML for all my graphical user interfaces, both web and desktop, thanks to ElecronJS.",
    "cssDesc": "Cascading Style Sheets (CSS) is a stylesheet language used to describe the presentation of a document written in HTML or XML (including XML dialects such as SVG, MathML or XHTML). CSS describes how elements should be rendered on screen, on paper, in speech, or on other media.",
    "cssUse": "I daily use CSS for styling all my projects, thanks to the great flexibility offered by flexbox module.",
    "goDesc": "Go is a fast statically typed, compiled high-level general purpose programming language. It is known for its simplicity and efficiency. It was designed at Google in 2009 by Robert Griesemer, Rob Pike, and Ken Thompson. It is syntactically similar to C, but also has memory safety, garbage collection, structural typing, and CSP-style concurrency.",
    "goUse": "I use this language for implementing REST APIs and command line tools.",
    "rustDesc": "Rust is blazingly fast and memory-efficient: with no runtime or garbage collector, it can power performance-critical services, run on embedded devices, and easily integrate with other languages.",
    "rustUse": "I use Rust for implementing desktop application, based on Tauri ecosystem.",
    "cDesc": "C is a general-purpose programming language. It was created in the 1970s by Dennis Ritchie and remains very widely used and influential. By design, C's features cleanly reflect the capabilities of the targeted CPUs.",
    "cUse": "I used this language in order to implement really optimized code for specific platforms.",
    "cppDesc": "C++ is a high-level, general-purpose programming language created by Danish computer scientist Bjarne Stroustrup. First released in 1985 as an extension of the C programming language, it has since expanded significantly over time.",
    "cppUse": "I used this language in large projects, ditributed between different teams.",
    "csDesc": "C# is an elegant and type-safe object-oriented language. C# enables developers to build many types of secure and robust applications that run in the .NET ecosystem.",
    "csUse": "I used C# for coding mainly desktop applications for Windows and I am still supporting some legacy code with this technology.",
    "javaDesc": "Java is a programming language and computing platform first released by Sun Microsystems in 1995. There are lots of applications and websites that will not work unless you have Java installed, and more are created every day. Java is fast, secure, and reliable.",
    "javaUse": "I used Java for deploying enterprise projects and Android native apps.",
    "tsDesc": "TypeScript is a strongly typed programming language that builds on JavaScript, giving you better tooling at any scale. TypeScript understands JavaScript and uses type inference to give you great tooling without additional code.",
    "tsUse": "I use TypeScript for all my projects, both frontend and backend, in order to improve the integration with the development environment and avoid runtime errors.",
    "codeDesc": "Visual Studio Code is a lightweight but powerful source code editor which runs on your desktop and is available for Windows, macOS and Linux. It comes with built-in support for JavaScript, TypeScript and Node.js and has a rich ecosystem of extensions for other languages",
    "codeUse": "Visual Studio Code is my main tool for virtually any issue, from coding to managing docker containers. By far the finest tool I had the pleasure to wotk with, in my humble opinion.",
    "vsDesc": "Microsoft Visual Studio is an integrated development environment (IDE) from Microsoft. It is used to develop computer programs, as well as websites, web apps, web services and mobile apps.",
    "vsUse": "I use Visual Studio form maintaining some legacy code, still based on .Net enviroment,",
    "eclipseDesc": "Eclipse is an integrated development environment (IDE) used in computer programming.[6] It contains a base workspace and an extensible plug-in system for customizing the environment. Eclipse is written mostly in Java and its primary use is for developing Java applications, but it may also be used to develop applications in other programming languages via plug-ins.",
    "eclipseUse": "I used Eclipse for coding Java enterprise applications and Business Intelligence projects.",
    "netbeansDesc": "NetBeans is an integrated development environment (IDE) for Java. NetBeans allows applications to be developed from a set of modular software components called modules.",
    "netbeansUse": "I used Eclipse for coding Java enterprise applications and Business Intelligence projects.",
    "androidDesc": "Android Studio is the official integrated development environment for Google's Android operating system, built on JetBrains' IntelliJ IDEA software and designed specifically for Android development.",
    "androidUse": "I used Android Studio for coding native Android applications.",
    "mongoDesc": "MongoDB is a cross-platform document-oriented database program. Classified as a NoSQL database program, MongoDB uses JSON-like documents with optional schemas. MongoDB is developed by MongoDB Inc. and licensed under the Server Side Public License (SSPL).",
    "mongoUse": "I use Mongo DB for all my proje/ts, due its schema less strategy and native Javascript support.",
    "mssqlDesc": "Microsoft SQL Server is a relational database management system developed by Microsoft. As a database server, it is a software product with the primary function of storing and retrieving data as requested by other software applications—which may run either on the same computer or on another computer across a network.",
    "mssqlUse": "I use a lot SQL server in data integration projects and Industry 4.0 issues.",
    "oracleDesc": "Oracle Database is a multi-model database management system produced and marketed by Oracle Corporation. It is a database commonly used for running online transaction processing (OLTP), data warehousing (DW) and mixed (OLTP & DW) database workloads.",
    "oracleUse": "I used this database mainly for coding ERP application with PL/SQL language.",
    "mysqlDesc": "MySQL Database Service is a fully managed database service to deploy cloud-native applications. HeatWave, an integrated, high-performance analytics engine accelerates MySQL performance by 400x.",
    "mysqlUse": "I use this database in different projects, mainly on Linux servers.",
    "postgresDesc": "PostgreSQL is a powerful, open source object-relational database system with over 30 years of active development that has earned it a strong reputation for reliability, feature robustness, and performance.",
    "postgresUse": "I used PostgreSQL in several occasion as a good alternative to Oracole database, due its compatibility with PL/SQL language.",
    "reactDesc": "React makes it painless to create interactive UIs. Design simple views for each state in your application, and React will efficiently update and render just the right components when your data changes.",
    "reactUse": "React is my main and only tool for creating the user inferface for all my web, desktop and mobile projects,",
    "tailwindDesc": "Tailwind CSS is an open-source CSS framework. Unlike other frameworks, like Bootstrap, it does not provide a series of predefined classes for elements such as buttons or tables. Instead, it creates a list of utility CSS classes that can be used to style each element by mixing and matching.",
    "tailwindUse": "I started using this library for styling all my project since 2022, this site included.",
    "shadcnDesc": "Beautifully designed components that you can copy and paste into your apps: Accessible, customizable, and open source.",
    "shadcnUse": "I started using this library for all my user interfaces in 2024, this site included.",
    "reduxDesc": "Redux helps you write applications that behave consistently, run in different environments (client, server, and native), and are easy to test. Centralizing your application's state and logic enables powerful capabilities like undo/redo, state persistence, and much more.",
    "reduxUse": "I use Redux Toolkit in order to create e single source of true for all my frontend projects and predict every possible application states.",
    "muiDesc": "Material UI offers a comprehensive suite of UI tools to help you ship new features faster. Start with Material UI, our fully-loaded component library, or bring your own design system to our production-ready components.",
    "muiUse": "Material UI is my main user interface library for all my projects, thanks to its ecosystem and high quality components library.",
    "nextjsDesc": "The React Framework for the Web. Used by some of the world's largest companies, Next.js enables you to create full-stack web applications by extending the latest React features, and integrating powerful Rust-based JavaScript tooling for the fastest builds.",
    "nextjsUse": "NextJs is my main tool for developing server side based application, in order to fully optimize SEO issues.",
    "expressDesc": "Express is a minimal and flexible Node.js web application framework that provides a robust set of features for web and mobile applications. With a myriad of HTTP utility methods and middleware at your disposal, creating a robust API is quick and easy.",
    "expressUse": "I used ExpressJS in voarious different backend project for fully compatible REST APIs.",
    "nodeDesc": "Node.js is an open-source, cross-platform, back-end, JavaScript runtime environment that executes JavaScript code outside a web browser. Node.js lets developers use JavaScript to write command line tools and for server-side scripting—running scripts server-side to produce dynamic web page content before the page is sent to the user's web browser.",
    "nodeTitle": "NodeJS is my main tool for all my server side and IoT / Industry 4.0 projects.",
    "mongooseDesc": "Mongoose provides a straight-forward, schema-based solution to model your application data. It includes built-in type casting, validation, query building, business logic hooks and more, out of the box.",
    "mongooseUse": "Mongoose is my favourite ODM tool which allows me to implement code-first strategy with MongoDB based projects.",
    "sequelizeDesc": "Sequelize is a modern TypeScript and Node.js ORM for Oracle, Postgres, MySQL, MariaDB, SQLite and SQL Server, and more. Featuring solid transaction support, relations, eager and lazy loading, read replication and more.",
    "sequelizeUse": "I used Sequelize to model and access different relational databases in several data acquisition systems.",
    "drizzleDesc": "It’s the only ORM with both relational and SQL-like query APIs, providing you the best of both worlds when it comes to accessing your relational data. Drizzle is lightweight, performant, typesafe, non-lactose, gluten-free, sober, flexible and serverless-ready by design. Drizzle is not just a library, it’s an experience.",
    "drizzleUse": "I use Drizzle in projects where access to SQL databases with efficient and highly optimized code is strictly necessary.",
    "prismaDesc": "Prisma provides the best experience for your team to work and interact with databases. Even complex things like connection pooling, caching, real-time database subscriptions are a breeze with our products.",
    "prismaUse": "I use Prisma in projects where it is necessary to access both SQL databases and noSQL databases at the same time.",
    "gitDesc": "Git is a free and open source distributed version control system designed to handle everything from small to very large projects with speed and efficiency.",
    "gitUse": "Every single line of code I've written since 2018 is managed via Git.",
    "githubDesc": "GitHub is an Internet hosting service for software development and version control using Git. It provides the distributed version control of Git plus access control, bug tracking, software feature requests, task management, continuous integration, and wikis for every project.",
    "gethubUse": "All the code I wrote from 2018 onwards is archived on Github",
    "postmanDesc": "Postman is an API platform for building and using APIs. Postman simplifies each step of the API lifecycle and streamlines collaboration so you can create better APIs—faster.",
    "postmanUse": "Each REST Api that I've wrote has been tested with this tool.",
    "adsDesc": "Azure Data Studio, designed specifically for the features most often used by data platform developers, offers additional experiences available as optional extensions. It was built for data professionals who use SQL Server and Azure databases on premises or in multi-cloud environments.",
    "adsUse": "I use Azure Data Studio to manage projects based on SQL databases.",
    "sqlmsDesc": "SQL Server Management Studio (SSMS) is an integrated environment for managing any SQL infrastructure, from SQL Server to Azure SQL Database. SSMS provides tools to configure, monitor, and administer instances of SQL Server and databases. Use SSMS to deploy, monitor, and upgrade the data-tier components used by your applications and build queries and scripts.",
    "sqlmsUse": "I use this tool for working with Microsost SQL server projects based."
  },

  "Certs": {
    "title": "Certifications - Mario Lazzari",
    "search": "Search topic"
  },

  "Hobbies": {
    "pageTitle": "Hobbies - Mario Lazzari",
    "title": "My hobbies",
    "artPageTitle": "Art - Mario Lazzari",
    "artTitle": "Art",
    "artText": "I discovered my passion for art traveling with my wife through our beautiful Italy, visiting art cities and museums: in this section you can query the catalogs of the most popular museums in the world.",
    "sciPageTitle": "Science - Mario Lazzari",
    "sciTitle": "Science",
    "sciText": "Since I was a kid I have always been fascinated by science, astronomy in particular: in this section you can access to all the services offered by NASA and similar structures.",
    "phyTitle": "Phylosophy",
    "phyText": "After high school I would like to study philosophy: however I continued to pursue this interest, reading my favorite authors (Plato, Kant, Hegel, Nietzsche, Heidegger)",
    "musTitle": "Music",
    "musText": "My father passed down to me the passion for the guitar, which I studied for over 20 years, teaching in 4 different modern academies and playing live in various bands.",
    "bokTitle": "Literature",
    "bokText": "I spend most of my free time reading my favorite authors, especially Dostoevskij, Celine, Kafka and Thomas Mann",
    "hysTitle": "Hystory",
    "hysText": "The study of the history and culture of different realities has allowed me to make and cultivate friendships with people of very different cultures from my own",
    "sprTitle": "Sport",
    "sprText": "When I was young I played basketball and I've always followed motorsports, F1 in particular",
    "cinTitle": "Cinema",
    "cinText": "I really love french commedies and investigative films in particular.",
    "relTitle": "Religion",
    "relText": "Although I am not a believer, I have always passionately studied religions from all over the world.",

    "spotifyPageTitle": "Spotify - Mario Lazzari",
    "spotifyTitle": "Spotify",
    "spotifyDesc": "My Spotify account and some other features, in order to query Spotify database.",
    "spotifyProfile": "Profile",
    "spotifyUser": "User",
    "spotifyProduct": "Product",
    "spotifyFollowers": "Followers",
    "spotifyCurrent": "Current playing",
    "spotifyTrack": "Track",
    "spotifyAlbum": "Album",
    "spotifyBand": "Band",
    "spotifyFollowed": "Followed artists",
    "spotifyPopularity": "Popularity",
    "spotifyTracks": "Recently played",
    "spotifyTopArtists": "Top artists",
    "spotifyTopTracks": "Top tracks",
    "quotableTitle": "Quotable",
    "quotableDesc": "Quotable is a free, open source quotations API, originally built as part of a FreeCodeCamp project. ",
    "quotableNew": "New",
    "quotableRandom": "Random",
    "todayPageTitle": "Today in history",
    "todayTitle": "Today in history",
    "todayDesc": "Events that occurred on a given date in history, including notable historical events, international holidays, and births and deaths of notable people.",
    "todayDay": "Day",
    "todaySelected": "Selected",
    "todayEvents": "Events",
    "todayBirths": "Births",
    "todayDeaths": "Deaths",
    "todayHolidays": "Holidays",
    "ergastPageTitle": "Ergast F1",
    "ergastTitle": "Ergast F1 API",
    "ergastDesc": "The Ergast Developer API is an experimental web service which provides a historical record of motor racing data for non-commercial purposes.",
    "ergastConstructors": "Constructors",
    "ergastDrivers": "Drivers",

    "more": "Learn more",
    "nasaPageTitle": "NASA Open API - Mario Lazzari",
    "nasaTitle": "NASA Open API",
    "nasaDesc": "In this section you will find lots on information, videos and images, made avaible by NASA official site: astronomic picture of the day, missions from both mars and moon and meny more.",
    "openaiPageTitle": "OpenAI - Mario Lazzari",
    "openaiTitle": "Open AI",
    "openaiDesc": "OpenAI is an American artificial intelligence (AI) research laboratory consisting of the non-profit OpenAI Incorporated (OpenAI Inc.) and its for-profit subsidiary corporation OpenAI Limited Partnership (OpenAI LP)",
    "openaiChat": "Chat GPT",
    "openaiImg": "Create Image",
    "openaiAsk": "Ask me",
    "openaiPlaceholder": "Ask me a question...",
    "openaiCreate": "Create",
    "openaiImagePlaceholder": "Image description to create...",

    "rijksPageTitle": "Rijksmuseum - Mario Lazzari",
    "rijksTitle": "Rijksmuseum",
    "rijksDesc": "Rijksmuseum data services provide access to object metadata, bibliographic data, controlled vocabularies and user generated content.",
    "metTitle": "Matropolitan museum",
    "metDesc": "The Metropolitan Museum of Art presents over 5,000 years of art from around the world for everyone to experience and enjoy. The Museum lives in two iconic sites in New York City",
    "phyApiPageTitle": "Phylosophy API - Mario Lazzari",
    "phyApiTitle": "Phylosophy API",
    "phyApiDesc": "The idea of the Philosophy API project is to provide a service that provides concise data about the World of Philosophy and a simple way to interact with the data and integrate it into your application.",
    "phyApiPhilos": "Philosophers",
    "phyApiIdeas": "Ideas",
    "phyApiBooks": "Books",
    "phyApiSchools": "Schools",
    "phyApiBio": "Bio"
  },

  "Nasa": {
    "pageTitle": "NASA - Mario Lazzari",
    "zoom": "Zoom",
    "zoomHD": "Zoom HD",
    "apod": "Daily Picture",
    "marsRovers": "Mars Rovers",
    "marsRovers0": "No picture found: try another day"
  },

  "Picker": {
    "from": "From",
    "to": "To",
    "date": "Date"
  },

  "Button": {
    "back": "Back",
    "more": "Learn more",
    "search": "Search",
    "options": "Options"
  }
}
