{
  "Menu": {
    "logo": "Mario Lazzari JavaScrip Full Stack Developer",
    "home": "Home",
    "certifications": "Certificazioni",
    "contacts": "Contatti",
    "skills": "Competenze",
    "hobbies": "Interessi",
    "jobs": "Lavoro"
  },

  "Home": {
    "pageTitle": "Mario Lazzari - JavaScript Full Stack Developer",
    "title": "Mario Lazzari",
    "subtitle": "JavaScript Full Stack Developer",
    "intro": "Benvenuti nel mio sito, nel quale potrete trovare alcune informazioni su di me, i miei interessi e gli strumenti che utilizzo quotidianamente come sviluppatore software.",
    "mailButton": "Mail",
    "cvButton": "CV",
    "skillsTitle": "Competenze",
    "skillsButton": "Dettagli",
    "certTitle": "Ultime certificazioni",
    "certButton": "Tutte"
  },

  "SkillTypes": {
    "os": "Sistemi Operativi",
    "lang": "Linguaggi",
    "ide": "IDE",
    "db": "Database",
    "lib": "Librerie",
    "tool": "Strumenti"
  },

  "Github": {
    "title": "Profilo Github",
    "followers": "Followers",
    "following": "Following",
    "projects": "Projects",
    "stars": "Stars",
    "forks": "Forks"
  },

  "Skills": {
    "title": "Competenze - Mario Lazzari",
    "os": "Sistemi operativi",
    "lang": "Linguaggi di programmazione",
    "db": "Database",
    "ide": "Ambienti di sviluppo",
    "libs": "Librerie",
    "tools": "Strumenti",
    "debianDesc": "Debian è un sistema operativo multipiattaforma che supporta varie architetture di computer, composto interamente da software libero. La sua forma più diffusa è 'Debian GNU/Linux', così denominata perché utilizza al suo interno programmi di utilità provenienti dal sistema operativo GNU e utilizzando Linux come kernel",
    "debianUse": "Ho utilizzato Debian principalmente come server web, FTP e progetti storage. Per anni ho utilizzato questa distribuzione anche sui mie pc personali.",
    "ubuntuDesc": "Ubuntu è un termine africano col quale è stato chiamato il sistema operativo nato nel 2004 e basato su Linux, più precisamente sul ramo unstable di Debian. Ubuntu è prevalentemente composto da software libero, distribuito liberamente con licenza GNU GPL, ma supporta anche software proprietario.",
    "ubuntuUse": "Utilizzato Ubuntu come server su cui pubblicarre tutti i miei progetti in produzione: questo sito stesso è gestito tramite un server Ubuntu 20.04 LTS.",
    "oracleLinuxDesc": "Oracle Linux è una distribuzione Linux pacchettizzata e distribuita gratuitamente da Oracle, disponibile parzialmente sotto la GNU General Public License dalla fine del 2006. È compilata dal codice sorgente di Red Hat Enterprise Linux, sostituendo il marchio Red Hat con quello di Oracle.",
    "oracleLinuxUse": "Oralce Linux è il sistema operativo che prediligo quando sviluppo applicativi basati su database Oracle.",
    "redHatDesc": "Red Hat® Enterprise Linux® è la piattaforma Linux di livello enterprise leader di settore*. È un sistema operativo open source (OS). Si tratta della base da cui partire per rendere le app esistenti scalabili e distribuire le tecnologie emergenti su software bare metal, virtuali, container e tutte le tipologie di ambienti cloud.",
    "redHatUse": "Ho utilizzato questo sistema operativo come valida alternativa a Oracle Linux, per osptare istanze database Oracle.",
    "winServerDesc": "Windows Server è il marchio di una famiglia di sistemi operativi per sistemi server realizzati da Microsoft Corporation. Il suo utilizzo è tipico di reti informatiche di qualsiasi numero di host per la centralizzazione di diverse funzioni di networking ad uso Internet ed intranet, come web server, posta elettronica, dhcp, dns...",
    "winServerUse": "Utilizzo questo sistema operativo principalmente come primary domain controller e per ospitare istanze Sql Sever.",
    "as400Desc": "Il sistema AS/400 (Application System/400) è stato un minicomputer sviluppato dall'IBM per usi prevalentemente aziendali, come supporto del sistema informativo gestionale. Nasce nel giugno 1988 come successore del system/38 e dopo oltre 30 anni è ancora in produzione; il nome commerciale è stato cambiato in iSeries nel 2000, in System i nel 2004 mentre oggi si chiama semplicemente I.",
    "as400Use": "Ho utilizzato questo sistema operativo per ospitare istanze database DB/2 e diversi ERP aziendali.",
    "solarisDesc": "Oracle Solaris (in passato noto anche come Solaris, Solaris Operating System o Solaris OS) è un sistema operativo Unix originariamente sviluppato da Sun Microsystems, scritto in linguaggio C e basato su SunOS 5.0: il 27 gennaio 2010 Oracle Corporation ha acquisito Sun Microsystems, diventando proprietaria di Solaris (divenuto Oracle Solaris).",
    "solarisUse": "Ho utilizzato questo sistema operativo per distribuire applicazioni Java enterprise.",
    "jsDesc": "JavaScript (spesso abbreviato in JS) è un linguaggio leggero, interpretato, funzionale e orientato agli oggetti, conosciuto per lo più come linguaggio di script per pagine web, ma utilizzato in molti ambienti non-browser così come node.js o Apache CouchDB.",
    "jsUse": "Utilizzo regolarmente JavaScript per tutti i miei progetti, sia lato client, che server. Grazie all'ecosistema NodeJS e a React Native, inoltre, sviluppo applicazioni mobile native e multi piattaforma.",
    "tsDesc": "TypeScript è un linguaggio di programmazione fortemente tipizzato che si basa su JavaScript, offrendo strumenti migliori su qualsiasi scala. TypeScript comprende JavaScript e utilizza l'inferenza del tipo per offrirti ottimi strumenti senza codice aggiuntivo.",
    "tsUse": "Utilizzo TypeScript per tutti i miei progetti, sia lato frontend, che backend, in modo tale da migliorare l'integrazione con l'ambiente di sviluppo ed evitare errori runtime.",
    "htmlDesc": "HTML (HyperText Markup Language) è il linguaggio utilizzato per creare pagine web e altri tipi di documenti visualizzabili in un browser. Insieme all'HTML vengono utilizzate altre tecnologie per modificare la presentazione/apparenza di una pagina web (CSS) o la sua funzionalità (JavaScript).",
    "htmlUse": "Utilizzo HTML per tutte le interfacce grafiche utente, sia web, che desktop, grazie a ElectronJS.",
    "cssDesc": "Il Cascading Style Sheets (CSS) è un linguaggio per fogli di stile utilizzato per descrivere la presentazione di un documento scritto in HTML o XML (inclusi vari linguaggi XML quali SVG o XHTML). Il CSS descrive come gli elementi dovrebbero apparire su schermo, su carta, nel parlato o in altri media.",
    "cssUse": "Utilizzo quotidianamente CSS per gestire l'aspetto di tutti i miei progetti, grazie alla grande flessibilità offerta dal modulo flexbox.",
    "csDesc": "C# è un linguaggio orientato a oggetti elegante e indipendente dai tipi. C# consente agli sviluppatori di compilare molti tipi di applicazioni sicure e affidabili eseguite nell'ecosistema .NET.",
    "csUse": "Ho utilizzato C# per sviluppare principalmente applicazioni descktop per Windows e utilizzo questa tecnologia per supportare applicazioni in produzione.",
    "javaDesc": "Java è una tecnologia utilizzata per lo sviluppo di applicazioni che rendono il Web più divertente e utile. Java è diverso da JavaScript in quanto quest'ultimo è una semplice tecnologia utilizzata per la creazione di pagine Web e viene eseguita solo nel browser.",
    "javaUse": "Ho utilizzato Java per sviluppare progetti aziendali e applicazioni Android native.",
    "codeDesc": "Visual Studio Code è un editor di codice sorgente sviluppato da Microsoft per Windows, Linux e macOS. Include il supporto per debugging, un controllo per Git integrato, Syntax highlighting, IntelliSense, Snippet e refactoring del codice. Sono personalizzabili il tema dell'editor, le scorciatoie da tastiera e le preferenze.",
    "codeUse": "Visual Studio Code è il mio strumento principale per pratiamente ogni ambito, dalla programmazione alla gestione di container Docker. Di gran lunga il miglior strumento che abbia mai avuto il piacere di utilizzare.",
    "vsDesc": "Microsoft Visual Studio è un ambiente di sviluppo integrato sviluppato da Microsoft. Visual Studio è multilinguaggio e attualmente supporta la creazione di progetti per varie piattaforme, tra cui anche Mobile e Console.",
    "vsUse": "Utilizzo Visual Studio per gestire applicazioni in produzione, basate ancora su ambiente .Net.",
    "eclipseDesc": "Eclipse è un ambiente di sviluppo integrato multi-linguaggio e multipiattaforma. Ideato da un consorzio di grandi società quali Ericsson, HP, IBM, Intel, MontaVista Software, QNX, SAP e Serena Software, chiamato Eclipse Foundation.",
    "eclipseUse": "Ho utilizzato Eclipse per sviluppare applicazioni Java enterprise e progetti di Business Intelligence.",
    "netbeansDesc": "NetBeans è un ambiente di sviluppo integrato multi-linguaggio, nato nel giugno 2000 e scritto interamente in Java, scelto dalla Oracle Corporation come IDE ufficiale.",
    "netbeansUse": "Ho utilizzato Eclipse per sviluppare applicazioni Java enterprise e progetti di Business Intelligence.",
    "androidDesc": "Android Studio è un ambiente di sviluppo integrato per lo sviluppo per la piattaforma Android. È stato annunciato il 16 maggio 2013 in occasione della conferenza Google I/O tenuta dal Product Manager Google, Katherine Chou.",
    "androidUse": "Ho utilizzato Android Studio per sviluppare applicazioni native Android.",
    "mongoDesc": "MongoDB  è un DBMS non relazionale, orientato ai documenti. Classificato come un database di tipo NoSQL, MongoDB si allontana dalla struttura tradizionale basata su tabelle dei database relazionali in favore di documenti in stile JSON con schema dinamico.",
    "mongoUse": "Utilizzo Mongo DB per tutti i miei progetti, grazie alla sua strategia a schema libero e al supporto nativo per JavaScript.",
    "mssqlDesc": "Microsoft SQL Server è un DBMS relazionale, prodotto da Microsoft. Nelle prime versioni era utilizzato per basi dati medio-piccole, ma a partire dalla versione 2000 è stato utilizzato anche per la gestione di basi dati di grandi dimensioni.",
    "mssqlUse": "Utilizzo frequentemente SQL server in progetti di integrazine / scambio dati e Industry 4.0.",
    "oracleDesc": "Oracle Database è uno tra i più famosi software di database management system sviluppato da Oracle Corporation. Scritto in linguaggio C, che fa parte dei cosiddetti RDBMS ovvero di sistemi di database basati sul modello relazionale affermatosi come standard",
    "oracleUse": "Ho utilizzato questo database principalmente per sviluppare software EPR basato su linguaggio PL/SQL.",
    "mysqlDesc": "MySQL Database Service è un servizio di database completamente gestito per distribuire applicazioni native del cloud utilizzando il database open source più diffuso al mondo. È sviluppato, gestito e supportato al 100% dal Team MySQL.",
    "mysqlUse": "Ho utilizzato questo database in diversi progetti. principalmente su server Linux.",
    "postgresDesc": "PostgreSQL +è un completo DBMS ad oggetti rilasciato con licenza libera. Spesso abbreviato Postgres, sebbene questo sia un nome vecchio dello stesso progetto, è una reale alternativa sia rispetto ad altri prodotti liberi come MySQL.",
    "postgresUse": "Ho utilizzato PostgreSQL come valida alternativa a database Oracle, grazie alla sua compatibilità con il linguaggio PL/SQL.",
    "reactDesc": "React rende la creazione di UI interattive facile e indolore. Progetta interfacce per ogni stato della tua applicazione. Ad ogni cambio di stato React aggiornerà efficientemente solamente le parti della UI che dipendono da tali dati.",
    "reactUse": "Utilizzo ReactJS per costruire le interfacce grafiche di tutti i miei progetti web, desktop e mobile.",
    "reduxDesc": "Redux aiuta a scrivere applicazioni che si comportano in modo coerente, vengono eseguite in ambienti diversi (client, server e nativi) e sono facili da testare. La centralizzazione dello stato e della logica dell'applicazione abilita potenti funzionalità come annulla/ripristina, persistenza dello stato e molto altro.",
    "reduxUse": "Utilizzo Redux Toolkit in tutti i miei progetti frontend, in modo tale da creare un'unica fonte dati e predire ogni possibile stato della mia applicazione.",
    "muiDesc": "Material UI offre una suite completa di strumenti di interfaccia utente per aiutarti a fornire nuove funzionalità più velocemente. Inizia con Material UI, la nostra libreria di componenti completamente caricata, o porta il tuo sistema di progettazione ai nostri componenti pronti per la produzione.",
    "muiUse": "Magerial UI è la libreria grafica che utilizzo per tutti i miei progetti, grazie al suo ecosistema e alla qualità dei componenti offerti.",
    "nextjsDesc": "Il framework React per il web. Utilizzato da alcune delle più grandi aziende del mondo, Next.js ti consente di creare applicazioni Web full-stack estendendo le ultime funzionalità di React e integrando potenti strumenti JavaScript basati su Rust per le build più veloci.",
    "nextjsUse": "NextJS è il mio strumento di sviluppo principale per creare applicazioni che necessitano il server side rendering, in modo tale da ottimizzare tutti gli aspetti legati al SEO.",
    "expressDesc": "Express è un framework per applicazioni web Node.js flessibile e leggero che fornisce una serie di funzioni avanzate per le applicazioni web e per dispositivi mobili. Con una miriade di metodi di utilità HTTP e middleware a disposizione, la creazione di un'API affidabile è un processo facile e veloce.",
    "expressUse": "Ho utilizzato ExpressJS in diversi progetti backend per implementare API REST in diversi contesti applicativi.",
    "nodeDesc": "NodeJS è una runtime di JavaScript Open source multipiattaforma orientato agli eventi per l'esecuzione di codice JavaScript, costruita sul motore JavaScript V8 di Google Chrome. Molti dei suoi moduli base sono scritti in JavaScript, e gli sviluppatori possono scrivere nuovi moduli in JavaScript.",
    "nodeUse": "NodeJS è il mio framework di riferimento sia per tutti i miei progetti backend che per quelli IoT / Industry 4.0. ",
    "mongooseDesc": "Mongoose fornisce una soluzione semplice e basata su schemi per modellare i dati dell'applicazione. Include casting di tipo integrato, convalida, creazione di query, hook di business logic e altro ancora, pronto all'uso.",
    "mongooseUse": "Mongoose è il mio ODM di riferimento per poter implementatr la strategia code-first in progetti basati su MongoDB.",
    "gitDesc": "Git è un sistema di controllo della versione distribuito gratuito e open source progettato per gestire qualsiasi cosa, dai progetti piccoli a quelli molto grandi con velocità ed efficienza.",
    "gitUse": "Ogni singola linea di codice da me scritta a partire dal 2018 è gestita tramite Git.",
    "githubDesc": "GitHub è un servizio di hosting Internet per lo sviluppo di software e il controllo della versione tramite Git. Fornisce il controllo della versione distribuita di Git più il controllo degli accessi, il monitoraggio dei bug, le richieste di funzionalità software, la gestione delle attività, l'integrazione continua e i wiki per ogni progetto.",
    "githubUse": "Tutto il codice da me scritto a partire dal 2018 in poi è archiviato su Github",
    "postmanDesc": "Postman è una piattaforma API per la creazione e l'utilizzo di API. Postman semplifica ogni fase del ciclo di vita dell'API e semplifica la collaborazione in modo da poter creare API migliori, più velocemente.",
    "postmanUse": "Ogni singola Api che ho scritto dal 2018 è stata testata con questo strumento.",
    "adsDesc": "Azure Data Studio, progettato in modo specifico per le funzionalità usate più spesso dagli sviluppatori di piattaforme dati, offre esperienze aggiuntive disponibili come estensioni facoltative. È stato creato per professionisti dei dati che usano database di SQL Server e Azure in locale o in ambienti multi-cloud.",
    "adsUse": "Utilizzo Azure Data Studio per gestire progetti basati su database SQL.",
    "sqlmsDesc": "SQL Server Management Studio (SSMS) è un ambiente integrato per la gestione di qualsiasi infrastruttura SQL, da SQL Server al database SQL di Azure. SSMS fornisce strumenti per configurare, monitorare e amministrare istanze di SQL Server e database. Usa SSMS per distribuire, monitorare e aggiornare i componenti del livello dati usati dalle tue applicazioni e creare query e script.",
    "sqlmsUse": "Uso questo strumento per lavorare con i progetti basati su server Microsost SQL."
  },

  "Certs": {
    "title": "Certificazioni - Mario Lazzari",
    "search": "Cerca argomento"
  },

  "Hobbies": {
    "pageTitle": "Interessi - Mario Lazzari",
    "title": "I miei interessi",
    "artPageTitle": "Arte - Mario Lazzari",
    "artTitle": "Arte",
    "artText": "Ho scoperto la passione per l'arte viaggiando con mia moglie attraverso la nostra bella Italia, visitando città d'arte e musei: in questa sezione potrete consultare i cataloghi dei musei più prestigiosi al mondo.",
    "sciPageTitle": "Scienza - Mario Lazzari",
    "sciTitle": "Scienza",
    "sciText": "Fin da piccolo sono sempre stato affascinato dalla scienza, astronomia in particolare: in questa sezione avrete la possibilità di accedere ai servizi offerti dalla Nasa e strutture simili.",
    "phyTitle": "Filosofia",
    "phyText": "Terminato il liceo mi sarebbe piaciuto molto studiare filosofia: ho comunque continuato a coltivare questo mio interesse, leggendo i miei autori preferiti (Platone, Kant, Hegel, Nietzsche, Heidegger)",
    "musTitle": "Musica",
    "musText": "Mio padre mi ha trasmesso la passione per la chitarra, che ho studiato per oltre vent'anni, insegnando in 4 accademie di musica moderna e suonando regolarmente dal vivo in diverse band.",
    "bokTitle": "Letteratura",
    "bokText": "Trascorro la maggior parte del mio tempo libero leggendo i miei autori preferiti, in particolar modo Dostoevskij, Celine, Kafka e Thomas Mann",
    "hysTitle": "Storia",
    "hysText": "Lo studio della storia e della cultura di diverse realtà mi ha consentito di stringere e coltivare amicizie con persone di culture moto differenti dalla mia",
    "sprTitle": "Sport",
    "sprText": "Da giovane ho praticato pallacanestro e ho sempre seguito con passione tutti gli sport automibilistici, F1 in particolare.",
    "cinTitle": "Cinema",
    "cinText": "Mi piacciono molto le commedie francesi e tutti i film d'inchiesta in generale.",
    "relTitle": "Religione",
    "relText": "Pur non essendo credente ho sempre studiato con passione le religioni di tutto il mondo.",

    "nasaTitle": "Nasa Open API",
    "nasaDesc": "In questa sezione potrai consultare una serie di informazioni, video e immagini,  messi a disposizione dal sito ufficiale della NASA: le foto astronomiche del giorno, le missioni su marte e la luna e molto altro.",
    "openaiPageTitle": "OpenAI - Mario Lazzari",
    "openaiTitle": "Open AI",
    "openaiDesc": "OpenAI è un'organizzazione senza fini di lucro di ricerca sull'intelligenza artificiale con lo scopo di promuovere e sviluppare un'intelligenza artificiale amichevole (friendly AI) in modo che l'umanità possa trarne beneficio.",
    "openaiChat": "Chat GPT",
    "openaiImg": "Crea Immagine",
    "openaiAsk": "Chiedi",
    "openaiPlaceholder": "Chiedimi qualcosa...",
    "openaiCreate": "Crea",
    "openaiImagePlaceholder": "Descrizione dell'immagine da creare...",

    "rijksPageTitle": "Rijksmuseum - Mario Lazzari",
    "rijksTitle": "Rijksmuseum",
    "rijksDesc": "I servizi di dati del Rijksmuseum forniscono l'accesso ai metadati degli oggetti, ai dati bibliografici, ai vocabolari controllati e ai contenuti generati dagli utenti.",
    "metTitle": "Metropolitan museum",
    "metDesc": "Il Metropolitan Museum of Art presenta oltre 5.000 anni di arte da tutto il mondo che tutti possono sperimentare e apprezzare. Il Museo risiede in due siti iconici a New York City",
    "phyApiPageTitle": "Phylosophy API - Mario Lazzari",
    "phyApiTitle": "Phylosophy API",
    "phyApiDesc": "L'idea del progetto Philosophy API è fornire un servizio che fornisca dati concisi sul mondo della filosofia e un modo semplice per interagire con i dati e integrarli nella tua applicazione.",
    "phyApiPhilos": "Filosofi",
    "phyApiIdeas": "Idee",
    "phyApiBooks": "Libri",
    "phyApiSchools": "Scuole",
    "phyApiBio": "Bio",
    "spotifyPageTitle": "Spotify - Mario Lazzari",
    "spotifyTitle": "Spotify",
    "spotifyDesc": "Il mio account Spotify e varie opizioni di ricerca sul database di Spotify.",
    "spotifyProfile": "Profilo",
    "spotifyUser": "Utente",
    "spotifyProduct": "Prodotto",
    "spotifyFollowers": "Followers",
    "spotifyCurrent": "Sto ascoltando",
    "spotifyTrack": "Traccia",
    "spotifyAlbum": "Album",
    "spotifyBand": "Gruppo",
    "spotifyFollowed": "Artisti seguiti",
    "spotifyPopularity": "Popolarità",
    "spotifyTracks": "Ultimi ascolti",
    "spotifyTopArtists": "Artisti preferiti",
    "spotifyTopTracks": "Pezzi preferiti",
    "quotableTitle": "Quotable",
    "quotableDesc": "Quotable è un'API di citazioni gratuita, open source, originariamente creata come sezione del progetto FreeCodeCamp.",
    "quotableNew": "Nuova",
    "quotableRandom": "Casuale",
    "todayPageTitle": "Today in history",
    "todayTitle": "Today in history",
    "todayDesc": "Eventi storici accaduti in un determinato giorno, includi importanti fatti storici, feste nazionali, nascite e morti di personaggi importanti.",
    "todaySelected": "Selezionati",
    "todayDay": "Giorno",
    "todayEvents": "Eventi",
    "todayBirths": "Nascite",
    "todayDeaths": "Morti",
    "todayHolidays": "Festività",
    "ergastPageTitle": "Ergast F1",
    "ergastTitle": "Ergast F1 API",
    "ergastDesc": "L'Ergast Developer API è un servizio web sperimentale che fornisce una registrazione storica dei dati delle corse automobilistiche per scopi non commerciali.",
    "ergastConstructors": "Costruttori",
    "ergastDrivers": "Piloti",

    "nasaPageTitle": "NASA Open API - Mario Lazzari"
  },

  "Nasa": {
    "nasa.zoom": "Zoom",
    "nasa.zoomHD": "Zoom HD",
    "nasa.apod": "Foto del giorno",
    "nasa.marsRovers": "Foto da Marte",
    "nasa.marsRovers0": "Nessuna foto trovata: prova un altro giorno"
  },

  "Picker": {
    "from": "Da",
    "to": "A",
    "date": "Data"
  },

  "Button": {
    "back": "Indietro",
    "more": "Scopri di più",
    "search": "Cerca",
    "options": "Opzioni"
  }
}
