[
  {
    "type": "os",
    "name": "Debian",
    "imagePath": "debian.png",
    "url": "https://www.debian.org",
    "description": [
      {
        "locale": "en",
        "text": "Debian also known as Debian GNU/Linux, is a Linux distribution composed of free and open-source software, developed by the community-supported Debian Project, which was established by Ian Murdock on August 16, 1993. The first version of Debian (0.01) was released on September 15, 1993, and its first stable version (1.1) was released on June 17, 1996."
      },
      {
        "locale": "it",
        "text": "Debian è un sistema operativo multipiattaforma che supporta varie architetture di computer, composto interamente da software libero. La sua forma più diffusa è 'Debian GNU/Linux', così denominata perché utilizza al suo interno programmi di utilità provenienti dal sistema operativo GNU e utilizzando Linux come kernel"
      }
    ],
    "useCase": [
      {
        "locale": "en",
        "text": "I used Debian mainly for web server, FTP service and storage projectsy. I use this distribution as my main desktop machine too for years."
      },
      {
        "locale": "it",
        "text": "Ho utilizzato Debian principalmente come server web, FTP e progetti storage. Per anni ho utilizzato questa distribuzione anche sui miei pc personali."
      }
    ]
  },
  {
    "type": "os",
    "name": "Ubuntu",
    "imagePath": "ubuntu.png",
    "url": "https://www.ubuntu.com",
    "description": [
      {
        "locale": "en",
        "text": "Ubuntu is a Linux distribution based on Debian and mostly composed of free and open-source software. Ubuntu is officially released in three editions: Desktop, Server,[and Core for Internet of things devices and robots. All the editions can run on the computer alone, or in a virtual machine. Ubuntu is a popular operating system for cloud computing, with support for OpenStack."
      },
      {
        "locale": "it",
        "text": "Ubuntu è un termine africano col quale è stato chiamato il sistema operativo nato nel 2004 e basato su Linux, più precisamente sul ramo unstable di Debian. Ubuntu è prevalentemente composto da software libero, distribuito liberamente con licenza GNU GPL, ma supporta anche software proprietario."
      }
    ],
    "useCase": [
      {
        "locale": "en",
        "text": "I used Ubuntu as my main production server, where to deploy all my projects: this site itself in hosted on a Ububto 20:04 LTS server."
      },
      {
        "locale": "it",
        "text": "Utilizzato Ubuntu come server su cui pubblicarre tutti i miei progetti in produzione: questo sito stesso è gestito tramite un server Ubuntu 20.04 LTS."
      }
    ]
  },
  {
    "type": "os",
    "name": "Oracle Linux",
    "imagePath": "oraclelinux.png",
    "url": "https://www.oracle.com/it/linux",
    "description": [
      {
        "locale": "en",
        "text": "Oracle Linux (abbreviated OL, formerly known as Oracle Enterprise Linux or OEL) is a Linux distribution packaged and freely distributed by Oracle, available partially under the GNU General Public License since late 2006. It is compiled from Red Hat Enterprise Linux (RHEL) source code, replacing Red Hat branding with Oracle's. It is also used by Oracle Cloud and Oracle Engineered Systems such as Oracle Exadata and others."
      },
      {
        "locale": "it",
        "text": "Oracle Linux è una distribuzione Linux pacchettizzata e distribuita gratuitamente da Oracle, disponibile parzialmente sotto la GNU General Public License dalla fine del 2006. È compilata dal codice sorgente di Red Hat Enterprise Linux, sostituendo il marchio Red Hat con quello di Oracle."
      }
    ],
    "useCase": [
      {
        "locale": "en",
        "text": "Oracle Linux is my primary choice, in order to host Oracle databese instance smoothly."
      },
      {
        "locale": "it",
        "text": "Oralce Linux è il sistema operativo che prediligo quando sviluppo applicativi basati su database Oracle."
      }
    ]
  },
  {
    "type": "os",
    "name": "RedHat Linux",
    "imagePath": "redhat.png",
    "url": "https://www.redhat.com",
    "description": [
      {
        "locale": "en",
        "text": "Red Hat® Enterprise Linux® is the world’s leading enterprise Linux platform.* It’s an open source operating system (OS). It’s the foundation from which you can scale existing apps—and roll out emerging technologies—across bare-metal, virtual, container, and all types of cloud environments."
      },
      {
        "locale": "it",
        "text": "Red Hat® Enterprise Linux® è la piattaforma Linux di livello enterprise leader di settore*. È un sistema operativo open source (OS). Si tratta della base da cui partire per rendere le app esistenti scalabili e distribuire le tecnologie emergenti su software bare metal, virtuali, container e tutte le tipologie di ambienti cloud."
      }
    ],
    "useCase": [
      {
        "locale": "en",
        "text": "I used this os as a good alternative to Oracle Linux, in order to host Oracle database instances."
      },
      {
        "locale": "it",
        "text": "Ho utilizzato questo sistema operativo come valida alternativa a Oracle Linux, per ospitare istanze database Oracle."
      }
    ]
  },
  {
    "type": "os",
    "name": "Windows Server",
    "imagePath": "winserver.png",
    "url": "https://www.windowserver.it/",
    "description": [
      {
        "locale": "en",
        "text": "Windows Server is a brand name for a group of server operating systems released by Microsoft. It includes all Windows operating systems that are branded 'Windows Server', but not any other Microsoft product. The first Windows server edition to be released under that brand was Windows Server 2003. However, the first server edition of Windows was Windows NT. "
      },
      {
        "locale": "it",
        "text": "Windows Server è il marchio di una famiglia di sistemi operativi per sistemi server realizzati da Microsoft Corporation. Il suo utilizzo è tipico di reti informatiche di qualsiasi numero di host per la centralizzazione di diverse funzioni di networking ad uso Internet ed intranet, come web server, posta elettronica, dhcp, dns..."
      }
    ],
    "useCase": [
      {
        "locale": "en",
        "text": "I use this operating system mainly as primary omain controller and for hosting Sql Server database instances."
      },
      {
        "locale": "it",
        "text": "Utilizzo questo sistema operativo principalmente come primary domain controller e per ospitare istanze Sql Sever."
      }
    ]
  },
  {
    "type": "os",
    "name": "AS/400",
    "imagePath": "as400.png",
    "url": "https://www.ibm.com/it-it/it-infrastructure/power/os/ibm-i",
    "description": [
      {
        "locale": "en",
        "text": "The IBM System i is a midrange computer platform from IBM, sometimes referred to generically by the umbrella term AS/400 or 'AS400'. The platform was first introduced as the AS/400 (Application System/400) in June 1988, with the operating system being called OS/400. In 2000, IBM introduced the eServer iSeries (with the 400 sometimes added[1]). As part of IBM's re-branding initiative in 2006, it was again renamed to System i."
      },
      {
        "locale": "it",
        "text": "Il sistema AS/400 (Application System/400) è stato un minicomputer sviluppato dall'IBM per usi prevalentemente aziendali, come supporto del sistema informativo gestionale. Nasce nel giugno 1988 come successore del system/38 e dopo oltre 30 anni è ancora in produzione; il nome commerciale è stato cambiato in iSeries nel 2000, in System i nel 2004 mentre oggi si chiama semplicemente I"
      }
    ],
    "useCase": [
      {
        "locale": "en",
        "text": "I used this operating system for hosting DB2 database instances and managing ERP softwares."
      },
      {
        "locale": "it",
        "text": "Ho utilizzato questo sistema operativo per ospitare istanze database DB/2 e diversi ERP aziendali."
      }
    ]
  },
  {
    "type": "os",
    "name": "Solaris",
    "imagePath": "solaris.png",
    "url": "https://www.ibm.com/it-it/it-infrastructure/power/os/ibm-i",
    "description": [
      {
        "locale": "en",
        "text": "Solaris is a proprietary Unix operating system originally developed by Sun Microsystems. It superseded the company's earlier SunOS in 1993. In 2010, after the Sun acquisition by Oracle, it was renamed Oracle Solaris. Solaris is known for its scalability, especially on SPARC systems, and for originating many innovative features such as DTrace, ZFS and Time Slider."
      },
      {
        "locale": "it",
        "text": "Oracle Solaris (in passato noto anche come Solaris, Solaris Operating System o Solaris OS) è un sistema operativo Unix originariamente sviluppato da Sun Microsystems, scritto in linguaggio C e basato su SunOS 5.0: il 27 gennaio 2010 Oracle Corporation ha acquisito Sun Microsystems, diventando proprietaria di Solaris (divenuto Oracle Solaris)."
      }
    ],
    "useCase": [
      {
        "locale": "en",
        "text": "I used this operating system for deploying enterprise Java applications."
      },
      {
        "locale": "it",
        "text": "Ho utilizzato questo sistema operativo per distribuire applicazioni Java enterprise."
      }
    ]
  },
  {
    "type": "lang",
    "name": "JavaScript",
    "imagePath": "javascript.png",
    "url": "https://developer.mozilla.org/it/docs/Web/JavaScript",
    "description": [
      {
        "locale": "en",
        "text": "JavaScript (JS) is a lightweight, interpreted, or just-in-time compiled programming language with first-class functions. While it is most well-known as the scripting language for Web pages, many non-browser environments also use it, such as Node.js, Apache CouchDB.0"
      },
      {
        "locale": "it",
        "text": "JavaScript (spesso abbreviato in JS) è un linguaggio leggero, interpretato, funzionale e orientato agli oggetti, conosciuto per lo più come linguaggio di script per pagine web, ma utilizzato in molti ambienti non-browser così come node.js o Apache CouchDB."
      }
    ],
    "useCase": [
      {
        "locale": "en",
        "text": "Javascript is my main programming language for all my client and server projrct. Thanks to NodeJS enviroment and React Native, I am able to code multiplatform native mobile app too."
      },
      {
        "locale": "it",
        "text": "Utilizzo regolarmente JavaScript per tutti i miei progetti, sia lato client, che server. Grazie all'ecosistema NodeJS e a React Native, inoltre, sviluppo applicazioni mobile native e multi piattaforma."
      }
    ]
  },
  {
    "type": "lang",
    "name": "HTML",
    "imagePath": "html.png",
    "url": "https://developer.mozilla.org/it/docs/Web/HTML",
    "description": [
      {
        "locale": "en",
        "text": "HTML (HyperText Markup Language) is the most basic building block of the Web. It defines the meaning and structure of web content. Other technologies besides HTML are generally used to describe a web page's appearance/presentation (CSS) or functionality/behavior (JavaScript)."
      },
      {
        "locale": "it",
        "text": "HTML (HyperText Markup Language) è il linguaggio utilizzato per creare pagine web e altri tipi di documenti visualizzabili in un browser. Insieme all'HTML vengono utilizzate altre tecnologie per modificare la presentazione/apparenza di una pagina web (CSS) o la sua funzionalità (JavaScript)."
      }
    ],
    "useCase": [
      {
        "locale": "en",
        "text": "I use HTML for all my graphical user interfaces, both web and desktop, thanks to ElecronJS."
      },
      {
        "locale": "it",
        "text": "Utilizzo HTML per tutte le interfacce grafiche utente, sia web, che desktop, grazie a ElectronJS."
      }
    ]
  },
  {
    "type": "lang",
    "name": "CSS",
    "imagePath": "css.png",
    "url": "https://developer.mozilla.org/it/docs/Web/CSS",
    "description": [
      {
        "locale": "en",
        "text": "Cascading Style Sheets (CSS) is a stylesheet language used to describe the presentation of a document written in HTML or XML (including XML dialects such as SVG, MathML or XHTML). CSS describes how elements should be rendered on screen, on paper, in speech, or on other media."
      },
      {
        "locale": "it",
        "text": "Il Cascading Style Sheets (CSS) è un linguaggio per fogli di stile utilizzato per descrivere la presentazione di un documento scritto in HTML o XML (inclusi vari linguaggi XML quali SVG o XHTML). Il CSS descrive come gli elementi dovrebbero apparire su schermo, su carta, nel parlato o in altri media."
      }
    ],
    "useCase": [
      {
        "locale": "en",
        "text": "I daily use CSS for styling all my projects, thanks to the great flexibility offered by flexbox module."
      },
      {
        "locale": "it",
        "text": "Utilizzo quotidianamente CSS per gestire l'aspetto di tutti i miei progetti, grazie alla grande flessibilità offerta dal modulo flexbox."
      }
    ]
  },
  {
    "type": "lang",
    "name": "C#",
    "imagePath": "cs.png",
    "url": "https://docs.microsoft.com/it-it/dotnet/csharp/",
    "description": [
      {
        "locale": "en",
        "text": "C# is an elegant and type-safe object-oriented language. C# enables developers to build many types of secure and robust applications that run in the .NET ecosystem."
      },
      {
        "locale": "it",
        "text": "C# è un linguaggio orientato a oggetti elegante e indipendente dai tipi. C# consente agli sviluppatori di compilare molti tipi di applicazioni sicure e affidabili eseguite nell'ecosistema .NET."
      }
    ],
    "useCase": [
      {
        "locale": "en",
        "text": "I used C# for coding mainly desktop applications for Windows and I am still supporting some legacy code with this technology. "
      },
      {
        "locale": "it",
        "text": "Ho utilizzato C# per sviluppare principalmente applicazioni descktop per Windows e utilizzo questa tecnologia per supportare applicazioni in produzione."
      }
    ]
  },
  {
    "type": "lang",
    "name": "Java",
    "imagePath": "java.png",
    "url": "https://www.java.com/",
    "description": [
      {
        "locale": "en",
        "text": "Java is a programming language and computing platform first released by Sun Microsystems in 1995. There are lots of applications and websites that will not work unless you have Java installed, and more are created every day. Java is fast, secure, and reliable."
      },
      {
        "locale": "it",
        "text": "Java è una tecnologia utilizzata per lo sviluppo di applicazioni che rendono il Web più divertente e utile. Java è diverso da JavaScript in quanto quest'ultimo è una semplice tecnologia utilizzata per la creazione di pagine Web e viene eseguita solo nel browser."
      }
    ],
    "useCase": [
      {
        "locale": "en",
        "text": "I used Java for deploying enterprise projects and Android native apps."
      },
      {
        "locale": "it",
        "text": "Ho utilizzato Java per sviluppare progetti aziendali e applicazioni Android native. "
      }
    ]
  },
  {
    "type": "ide",
    "name": "Visual Studio Code",
    "imagePath": "code.png",
    "url": "https://code.visualstudio.com/",
    "description": [
      {
        "locale": "en",
        "text": "Visual Studio Code is a lightweight but powerful source code editor which runs on your desktop and is available for Windows, macOS and Linux. It comes with built-in support for JavaScript, TypeScript and Node.js and has a rich ecosystem of extensions for other languages "
      },
      {
        "locale": "it",
        "text": "Visual Studio Code è un editor di codice sorgente sviluppato da Microsoft per Windows, Linux e macOS. Include il supporto per debugging, un controllo per Git integrato, Syntax highlighting, IntelliSense, Snippet e refactoring del codice. Sono personalizzabili il tema dell'editor, le scorciatoie da tastiera e le preferenze."
      }
    ],
    "useCase": [
      {
        "locale": "en",
        "text": "Visual Studio Code is my main tool for virtually any issue, from coding to managing docker containers. By far the finest tool I had the pleasure to wotk with, in my humble opinion."
      },
      {
        "locale": "it",
        "text": "Visual Studio Code è il mio strumento principale per praticamente ogni ambito, dalla programmazione alla gestione di container Docker. Di gran lunga il miglior strumento che abbia mai avuto il piacere di utilizzare."
      }
    ]
  },
  {
    "type": "ide",
    "name": "Visual Studio",
    "imagePath": "vs.png",
    "url": "",
    "description": [
      {
        "locale": "en",
        "text": "Microsoft Visual Studio is an integrated development environment (IDE) from Microsoft. It is used to develop computer programs, as well as websites, web apps, web services and mobile apps."
      },
      {
        "locale": "it",
        "text": "Microsoft Visual Studio è un ambiente di sviluppo integrato sviluppato da Microsoft. Visual Studio è multilinguaggio e attualmente supporta la creazione di progetti per varie piattaforme, tra cui anche Mobile e Console."
      }
    ],
    "useCase": [
      {
        "locale": "en",
        "text": "I use Visual Studio form maintaining some legacy code, still based on .Net enviroment,"
      },
      {
        "locale": "it",
        "text": "Utilizzo Visual Studio per gestire applicazioni in produzione, basate ancora su ambiente .Net."
      }
    ]
  },
  {
    "type": "ide",
    "name": "Eclipse",
    "imagePath": "eclipse.png",
    "url": "",
    "description": [
      {
        "locale": "en",
        "text": "Eclipse is an integrated development environment (IDE) used in computer programming.[6] It contains a base workspace and an extensible plug-in system for customizing the environment. Eclipse is written mostly in Java and its primary use is for developing Java applications, but it may also be used to develop applications in other programming languages via plug-ins."
      },
      {
        "locale": "it",
        "text": "Eclipse è un ambiente di sviluppo integrato multi-linguaggio e multipiattaforma. Ideato da un consorzio di grandi società quali Ericsson, HP, IBM, Intel, MontaVista Software, QNX, SAP e Serena Software, chiamato Eclipse Foundation."
      }
    ],
    "useCase": [
      {
        "locale": "en",
        "text": "I used Eclipse for coding Java enterprise applications and Business Intelligence projects."
      },
      {
        "locale": "it",
        "text": "Ho utilizzato Eclipse per sviluppare applicazioni Java enterprise e progetti di Business Intelligence."
      }
    ]
  },
  {
    "type": "ide",
    "name": "Netbeans",
    "imagePath": "netbeans.png",
    "url": "https://netbeans.org/",
    "description": [
      {
        "locale": "en",
        "text": "NetBeans is an integrated development environment (IDE) for Java. NetBeans allows applications to be developed from a set of modular software components called modules."
      },
      {
        "locale": "it",
        "text": "NetBeans è un ambiente di sviluppo integrato multi-linguaggio, nato nel giugno 2000 e scritto interamente in Java, scelto dalla Oracle Corporation come IDE ufficiale."
      }
    ],
    "useCase": [
      {
        "locale": "en",
        "text": "I used Netbeans for coding Java enterprise applications and Business Intelligence projects."
      },
      {
        "locale": "it",
        "text": "Ho utilizzato Netbeans per sviluppare applicazioni Java enterprise e progetti di Business Intelligence."
      }
    ]
  },
  {
    "type": "ide",
    "name": "Android Studio",
    "imagePath": "androidstudio.png",
    "url": "https://developer.android.com/codelabs/basic-android-kotlin-training-change-app-icon#0",
    "description": [
      {
        "locale": "en",
        "text": "Android Studio is the official integrated development environment for Google's Android operating system, built on JetBrains' IntelliJ IDEA software and designed specifically for Android development."
      },
      {
        "locale": "it",
        "text": "Android Studio è un ambiente di sviluppo integrato per lo sviluppo per la piattaforma Android. È stato annunciato il 16 maggio 2013 in occasione della conferenza Google I/O tenuta dal Product Manager Google, Katherine Chou."
      }
    ],
    "useCase": [
      {
        "locale": "en",
        "text": "I used Android Studio for coding native Android applications."
      },
      {
        "locale": "it",
        "text": "Ho utilizzato Android Studio per sviluppare applicazioni native Android."
      }
    ]
  },
  {
    "type": "db",
    "name": "MongoDB",
    "imagePath": "mongodb.png",
    "url": "https://www.mongodb.com/",
    "description": [
      {
        "locale": "en",
        "text": "MongoDB is a cross-platform document-oriented database program. Classified as a NoSQL database program, MongoDB uses JSON-like documents with optional schemas. MongoDB is developed by MongoDB Inc. and licensed under the Server Side Public License (SSPL)."
      },
      {
        "locale": "it",
        "text": "MongoDB  è un DBMS non relazionale, orientato ai documenti. Classificato come un database di tipo NoSQL, MongoDB si allontana dalla struttura tradizionale basata su tabelle dei database relazionali in favore di documenti in stile JSON con schema dinamico. "
      }
    ],
    "useCase": [
      {
        "locale": "en",
        "text": "I use Mongo DB for all my proje/ts, due its schema less strategy and native Javascript support."
      },
      {
        "locale": "it",
        "text": "Utilizzo Mongo DB per tutti i miei progetti, grazie alla sua strategia a schema libero e al supporto nativo per JavaScript."
      }
    ]
  },
  {
    "type": "db",
    "name": "SQL Server",
    "imagePath": "sqlserver.png",
    "url": "",
    "description": [
      {
        "locale": "en",
        "text": "Microsoft SQL Server is a relational database management system developed by Microsoft. As a database server, it is a software product with the primary function of storing and retrieving data as requested by other software applications—which may run either on the same computer or on another computer across a network. "
      },
      {
        "locale": "it",
        "text": "Microsoft SQL Server è un DBMS relazionale, prodotto da Microsoft. Nelle prime versioni era utilizzato per basi dati medio-piccole, ma a partire dalla versione 2000 è stato utilizzato anche per la gestione di basi dati di grandi dimensioni."
      }
    ],
    "useCase": [
      {
        "locale": "en",
        "text": "I use a lot SQL server in data integration projects and Industry 4.0 issues."
      },
      {
        "locale": "it",
        "text": "Utilizzo frequentemente SQL server in progetti di integrazine / scambio dati e Industry 4.0."
      }
    ]
  },
  {
    "type": "db",
    "name": "Oracle",
    "imagePath": "oracle.png",
    "url": "https://www.oracle.com/it/database/",
    "description": [
      {
        "locale": "en",
        "text": "Oracle Database is a multi-model database management system produced and marketed by Oracle Corporation. It is a database commonly used for running online transaction processing (OLTP), data warehousing (DW) and mixed (OLTP & DW) database workloads."
      },
      {
        "locale": "it",
        "text": "Oracle Database è uno tra i più famosi software di database management system sviluppato da Oracle Corporation. Scritto in linguaggio C, che fa parte dei cosiddetti RDBMS ovvero di sistemi di database basati sul modello relazionale affermatosi come standard"
      }
    ],
    "useCase": [
      {
        "locale": "en",
        "text": "I used this database mainly for coding ERP application with PL/SQL language."
      },
      {
        "locale": "it",
        "text": "Ho utilizzato questo database principalmente per sviluppare software EPR basato su linguaggio PL/SQL. "
      }
    ]
  },
  {
    "type": "db",
    "name": "MySQL",
    "imagePath": "mysql.png",
    "url": "https://www.mysql.com/",
    "description": [
      {
        "locale": "en",
        "text": "MySQL Database Service is a fully managed database service to deploy cloud-native applications. HeatWave, an integrated, high-performance analytics engine accelerates MySQL performance by 400x."
      },
      {
        "locale": "it",
        "text": "MySQL Database Service è un servizio di database completamente gestito per distribuire applicazioni native del cloud utilizzando il database open source più diffuso al mondo. È sviluppato, gestito e supportato al 100% dal Team MySQL."
      }
    ],
    "useCase": [
      {
        "locale": "en",
        "text": "I use this database in different projects, mainly on Linux servers."
      },
      {
        "locale": "it",
        "text": "Ho utilizzato questo database in diversi progetti. principalmente su server Linux."
      }
    ]
  },
  {
    "type": "db",
    "name": "PostgreSQL",
    "imagePath": "postgres.png",
    "url": "https://www.postgresql.org/",
    "description": [
      {
        "locale": "en",
        "text": "PostgreSQL is a powerful, open source object-relational database system with over 30 years of active development that has earned it a strong reputation for reliability, feature robustness, and performance."
      },
      {
        "locale": "it",
        "text": "PostgreSQL +è un completo DBMS ad oggetti rilasciato con licenza libera. Spesso abbreviato Postgres, sebbene questo sia un nome vecchio dello stesso progetto, è una reale alternativa sia rispetto ad altri prodotti liberi come MySQL."
      }
    ],
    "useCase": [
      {
        "locale": "en",
        "text": "I used PostgreSQL in several occasion as a good alternative to Oracole database, due its compatibility with PL/SQL language."
      },
      {
        "locale": "it",
        "text": "Ho utilizzato PostgreSQL come valida alternativa a database Oracle, grazie alla sua compatibilità con il linguaggio PL/SQL."
      }
    ]
  }
]
